package mhw;

import java.util.Arrays;

public class CommonConst {
    public static String[] MONSTERS = new String[]{"大凶豺龙", "骚鸟", "毒妖鸟", "土砂龙", "泥鱼龙", "飞雷龙", "蛮颚龙"
            , "瓷火龙", "眩鸟", "浮空龙", "大凶颚龙", "骨锤龙", "风飘龙", "惨爪龙", "火龙", "角龙", "麒麟", "熔山龙", "岩贼龙", "樱火龙" +
            "爆鳞龙", "恐暴龙", "熔岩龙", "爆锤龙", "苍火龙", "黑角龙", "灭尽龙", "炎王龙", "炎妃龙", "钢龙", "尸套龙", "绚辉龙", "冥灯龙"
            , "冰鱼龙", "蒙牛龙", "痹毒龙", "浮眠龙", "水妖鸟", "冰牙龙", "迅龙", "斩龙", "轰龙", "碎龙", "霜翼风漂龙", "雷颚龙", "硫斩龙",
            "凶爪龙", "冰咒龙", "红莲爆鳞龙", "雾瘴尸套龙", "溟波龙", "惶怒恐暴龙", "歼世灭尽龙", "天地煌啼龙", "雷狼龙", "黑狼鸟", "战痕黑狼鸟",
            "黑轰龙", "金火龙", "银火龙", "金狮子", "狱狼龙", "冥赤龙", "激昂金狮子", "萌爆碎龙", "霜刃冰牙龙", "煌黑龙", "黑龙", "贝希摩斯",
            "鹿首精", "古代鹿首精"};
    public static String[] ARMS = new String[]{"大剑","太刀","单手剑","双剑","大锤","狩猎笛","长枪","铳枪","斩击斧","充能斧"
    ,"操虫棍","轻弩","重弩","弓"};

}
